import datetime
import os
import time
from colorama import init, Fore

# объявляем переменные
square='\u25A0'
counter = 0
one=[   [0, 0, 1, 0, 0],
        [0, 1, 1, 0, 0],
        [1, 0, 1, 0, 0],
        [0, 0, 1, 0, 0],
        [0, 0, 1, 0, 0],
        [0, 0, 1, 0, 0],
        [0, 0, 1, 0, 0],
       ] 
two=[   [0, 1, 1, 1, 0],
        [1, 0, 0, 0, 1],
        [0, 0, 0, 0, 1],
        [0, 0, 0, 1, 0],
        [0, 0, 1, 0, 0],
        [0, 1, 0, 0, 0],
        [1, 1, 1, 1, 1],
       ] 
three= [   [1, 1, 1, 1, 1],
        [0, 0, 0, 0, 1],
        [0, 0, 0, 0, 1],
        [1, 1, 1, 1, 1],
        [0, 0, 0, 0, 1],
        [0, 0, 0, 0, 1],
        [1, 1, 1, 1, 1],
       ] 
four=[   [1, 0, 0, 0, 1],
        [1, 0, 0, 0, 1],
        [1, 0, 0, 0, 1],
        [1, 1, 1, 1, 1],
        [0, 0, 0, 0, 1],
        [0, 0, 0, 0, 1],
        [0, 0, 0, 0, 1],
       ] 
five=[   [1, 1, 1, 1, 1],
        [1, 0, 0, 0, 0],
        [1, 1, 1, 1, 0],
        [0, 0, 0, 0, 1],
        [0, 0, 0, 0, 1],
        [0, 0, 0, 0, 1],
        [1, 1, 1, 1, 0],
       ] 
six= [   [1, 1, 1, 1, 1],
        [1, 0, 0, 0, 0],
        [1, 0, 0, 0, 0],
        [1, 1, 1, 1, 1],
        [1, 0, 0, 0, 1],
        [1, 0, 0, 0, 1],
        [1, 1, 1, 1, 1],
       ] 
seven=[   [1, 1, 1, 1, 1],
        [0, 0, 0, 0, 1],
        [0, 0, 0, 1, 0],
        [0, 0, 1, 0, 0],
        [0, 1, 0, 0, 0],
        [0, 1, 0, 0, 0],
        [0, 1, 0, 0, 0],
       ] 
eight=[   [0, 1, 1, 1, 0],
        [1, 0, 0, 0, 1],
        [1, 0, 0, 0, 1],
        [0, 1, 1, 1, 0],
        [1, 0, 0, 0, 1],
        [1, 0, 0, 0, 1],
        [0, 1, 1, 1, 0],
       ] 
nine=[   [0, 1, 1, 1, 0],
        [1, 0, 0, 0, 1],
        [1, 0, 0, 0, 1],
        [0, 1, 1, 1, 1],
        [0, 0, 0, 1, 0],
        [0, 0, 1, 0, 0],
        [0, 1, 0, 0, 0],
       ] 
zero=[   [1, 1, 1, 1, 1],
        [1, 0, 0, 0, 1],
        [1, 0, 0, 0, 1],
        [1, 0, 0, 0, 1],
        [1, 0, 0, 0, 1],
        [1, 0, 0, 0, 1],
        [1, 1, 1, 1, 1],
       ] 

colon1 = [   [0, 0, 0, 0, 0],
        [0, 0, 0, 0, 0],
        [0, 0, 1, 0, 0],
        [0, 0, 0, 0, 0],
        [0, 0, 1, 0, 0],
        [0, 0, 0, 0, 0],
        [0, 0, 0, 0, 0],
       ]
colon2 = [   [0, 0, 0, 0, 0],
        [0, 0, 0, 0, 0],
        [0, 0, 0, 0, 0],
        [0, 0, 0, 0, 0],
        [0, 0, 0, 0, 0],
        [0, 0, 0, 0, 0],
        [0, 0, 0, 0, 0],
       ]

# определяем функцию для мигания. что-то с генераором не придумалось, поэтому return
def winging(count):
    if count%2==0:
        return colon1
    else: 
        return colon2

# заводим цикл
while True:
    colon=winging(counter)

# создаем словарь для сопоставления распарсенных символов в строке текущее_время с переменными. Так как есть мигание, то он в цикле
    dict = {'1':one, '2':two, '3':three, '4':four,
       '5':five, '6':six, '7':seven, '8': eight, 
       '9': nine, '0': zero, ':': colon}

  # объявляем пустой список, состоящий из списков
    clock = [   [0, 0, 0, 0, 0],
        [0, 0, 0, 0, 0],
        [0, 0, 0, 0, 0],
        [0, 0, 0, 0, 0],
        [0, 0, 0, 0, 0],
        [0, 0, 0, 0, 0],
        [0, 0, 0, 0, 0],
       ]

#получаем текущее время и преобразуем в строку
    current_time=datetime.datetime.now()
    current_time_str=current_time.strftime("%H:%M:%S")

    # объединяем все символы в новый список, а по сути матрицу 7x45 
    for symbol in current_time_str:
        x = dict[symbol]
        clock = [i + j for i, j in zip(clock, x)]
    
 # печатаем построчно  
    for row in clock:            
        for elem in row:     
            if elem==1:
               print(Fore.CYAN+square, end = ' ')
            else: print(" ", end = ' ')
        print()
        
 # очищаем экран, делаем паузу, итерируем счетчик       
    counter+=1
    os.system('cls')
    time.sleep(0.3)


